#Задача 10: Напишите программу,
#которая принимает на вход трёхзначное число
#и на выходе показывает вторую цифру этого числа.

number = input('Enter 3-digit number: ')
res = number[-2]
print(res)
