# Напишите программу, которая задаёт массив из 8 элементов
# и выводит их на экран.

array = []

for i in range(8):
    array.append(input('Enter your number '))

print(array)